	#pragma once
	#include "memory.h"
	#include "unrealengine.h"
	#include "Decryptor.h"
	#include "options.hpp"
	#include "Hookign/ret_spoofing.h"
	#include "Hookign/spoofer.h"
#include <algorithm>
#include <ctime> // needed for std::time, std::localtime
int index = 453;
int elements_count = 0;
FLinearColor HSVtoRGB2(float h, float s, float v)
{
	float R, G, B;

	int i = int(h * 6.0f);
	float f = h * 6.0f - i;
	float p = v * (1.0f - s);
	float q = v * (1.0f - f * s);
	float t = v * (1.0f - (1.0f - f) * s);

	switch (i % 6) {
	case 0: R = v; G = t; B = p; break;
	case 1: R = q; G = v; B = p; break;
	case 2: R = p; G = v; B = t; break;
	case 3: R = p; G = q; B = v; break;
	case 4: R = t; G = p; B = v; break;
	case 5: R = v; G = p; B = q; break;
	}

	return FLinearColor(R, G, B, 1.0f);
}
FLinearColor BOSSRAINBOMAW(float time)
{

	const float PI = 3.14159265359f;
	float R = 0.5f + 0.5f * sin(time);
	float G = 0.5f + 0.5f * sin(time + 2.0f * PI / 3.0f);
	float B = 0.5f + 0.5f * sin(time + 4.0f * PI / 3.0f);
	return FLinearColor(R, G, B, 1.0f);
}
float rainbowTimeZ = 0;
float rainbowTimeZRGB = 0;
enum class e_blend_mode : uint8_t
{
	opaque = 0,
	masked = 1,
	translucent = 2,
	additive = 3,
	modulate = 4,
	alpha_composite = 5,
	max = 6,
};
		struct FHitResult {
		int32_t FaceIndex; // 0x00(0x04)
		float Time; // 0x04(0x04)
		float Distance; // 0x08(0x04)
		float PenetrationDepth; // 0x54(0x04)
		int32_t Item; // 0x58(0x04)
		char ElementIndex; // 0x5c(0x01)
		char bBlockingHit : 1; // 0x5d(0x01)
		char bStartPenetrating : 1; // 0x5d(0x01)
		char pad_5D_2 : 6; // 0x5d(0x01)
		char pad_5E[0x2]; // 0x5e(0x02)
		struct FName BoneName; // 0x78(0x0c)
		struct FName MyBoneName; // 0x84(0x0c)
	};
	template<class type> class enum_as_byte {
	public:
		enum_as_byte() {}
		enum_as_byte(type value) : value(static_cast<std::uint8_t>(value)) {}

		explicit enum_as_byte(std::int32_t value) : value(static_cast<std::uint8_t>(value)) {}
		explicit enum_as_byte(std::uint8_t value) : value(value) {}

		operator type() const { return type(value); }
		type get() const { return type(value); }
		type* cast() {
			return reinterpret_cast<type*>(this);
		}
	private:
		std::uint8_t value;
	};

	static enum search_case : std::uint8_t {
		case_sensitive, ignore_case
	};
	struct SkinData {
		const wchar_t* SkinName;
		const wchar_t* skin;
		const wchar_t* chroma;
		int level;
	};

	namespace keys
	{
		fkey_ left_mouse;
		fkey_ right_mouse;
		fkey_ insert;

		fkey_ w;
		fkey_ A;
		fkey_ s;
		fkey_ d;

		fkey_ space;
		fkey_ capslock;
	}

	class UObject
	{
	public:


		char padding_01[0x18];
